* Generic GNUS/mail setup.

; Specific GNUS/mail setup (servers)
;   - should be elsewhere

#+BEGIN_SRC emacs-lisp
(setq mm-discouraged-alternatives '("text/html" "text/richtext"))
(setq gnus-inhibit-mime-unbuttonizing t)
(setq gnus-mime-display-multipart-related-as-mixed t)
(setq gnus-buttonized-mime-types
      '("multipart/alternative" "multipart/signed"))

(setq-default
 gnus-summary-line-format "%U%R%z %(%&user-date;  %-15,15f %* %B%s%)\n"
 gnus-user-date-format-alist '((t . "%Y-%m-%d %H:%M"))
 gnus-summary-thread-gathering-function 'gnus-gather-threads-by-references
 gnus-thread-sort-functions '(gnus-thread-sort-by-date)
 gnus-sum-thread-tree-false-root ""
 gnus-sum-thread-tree-indent " "
 gnus-sum-thread-tree-leaf-with-other "├► "
 gnus-sum-thread-tree-root ""
 gnus-sum-thread-tree-single-leaf "╰► "
 gnus-sum-thread-tree-vertical "│")

(message "gnusSettings.org finished.")
#+END_SRC

#+RESULTS:
: │

